[{"title": "Media Get a Close-Up of NASA's Mars 2020 Rover", "preview": "The clean room at NASA's Jet Propulsion Laboratory was open to the media to see NASA's next Mars explorer before it leaves for Florida in preparation for a summertime launch."}, {"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "Hear Audio From NASA's Perseverance As It Travels Through Deep Space", "preview": "The first to be rigged with microphones, the agency's latest Mars rover picked up the subtle sounds of its own inner workings during interplanetary flight."}, {"title": "Screening Soon: 'The Pathfinders' Trains Lens on Mars", "preview": "With the Mars 2020 mission ramping up, the documentary — the first of four about past JPL missions to the Red Planet to be shown at Caltech — tells a gripping backstory."}, {"title": "MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss", "preview": "Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."}, {"title": "NASA's Perseverance Mars Rover Gets Balanced", "preview": "The mission team performed a crucial weight-balancing test on the rover in preparation for this summer's history-making launch to the Red Planet."}, {"title": "NASA's Mars Helicopter Attached to Mars 2020 Rover ", "preview": "The helicopter will be first aircraft to perform flight tests on another planet."}, {"title": "Air Deliveries Bring NASA's Perseverance Mars Rover Closer to Launch", "preview": "A NASA Wallops Flight Facility cargo plane transported more than two tons of equipment — including the rover's sample collection tubes — to Florida for this summer's liftoff."}, {"title": "InSight's 'Mole' Team Peers into the Pit", "preview": "Efforts to save the heat probe continue."}, {"title": "NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet", "preview": "The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July."}, {"title": "What's Mars Solar Conjunction, and Why Does It Matter?", "preview": "NASA spacecraft at Mars are going to be on their own for a few weeks when the Sun comes between Mars and Earth, interrupting communications."}, {"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "NASA's Mars Rover Drivers Need Your Help", "preview": "Using an online tool to label Martian terrain types, you can train an artificial intelligence algorithm that could improve the way engineers guide the Curiosity rover."}, {"title": "NASA's MAVEN Maps Winds in the Martian Upper Atmosphere that Mirror the Terrain Below and Gives Clues to Martian Climate", "preview": "Researchers have created the first map of wind circulation in the upper atmosphere of a planet besides Earth, using data from NASA’s MAVEN spacecraft that were collected during the last two years."}, {"title": "NASA's Mars Perseverance Rover Passes Flight Readiness Review", "preview": "​The agency's Mars 2020 mission has one more big prelaunch review – the Launch Readiness Review, on July 27."}]